import React, {Component} from 'react';
import './About.css'
import '@fortawesome/fontawesome-free/css/all.min.css';
import 'bootstrap-css-only/css/bootstrap.min.css';
import 'mdbreact/dist/css/mdb.css';
import {MDBCol, MDBIcon, MDBView} from "mdbreact";


// import  imOdessa from ''

import imageSrc from '../../Image/StandardLogoFiles/OriginalonTransparent2.png'
import slideImage from "../../Image/qwertyuiop123456789.jpg";
import slideImage2 from "../../Image/der.jpg";
import slideImage3 from "../../Image/theatr.jpg";
import slideImage4 from "../../Image/seaport.jpg";
import slideImage5 from "../../Image/256995632.jpg";

class About extends Component {


    render() {
        return (
            <div className='contacts-block'>
                        <div className='container w-100'>
                            <h3 className='h3-responsive  pt-3 pt-sm-5 mb-0 pb-3 pb-md-5 pb-xl-5 pb-lg-5 font-weight-bold text-center'>Про компанію</h3>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="logo-image d-block w-100 m-auto py-2"
                                    src={imageSrc}
                                    alt="First slide"
                                />
                                <div className='py-2 py-sm-4'>
                                    <p className='about-odessa-text m-0'>
                                        <span className='font-weight-bold'>LuxeApartments company</span> пропонує послуги оренди квартир у місті Одеса на Україні. Ми пропонуємо можливість знайти найкращий варіант для Вашого відпочинку. Наша ціль - забезпечити комфортне та якісне перебування та забезпечення житлом у місті Одеса. Наші апартаменти в основному зосереджені в Аркадії та центрі. Ми знайдемо найкращі варіанти для Вас. Наша база данних налічує велику кількість апартаментів.
                                    </p>
                                </div>
                            </div>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="slide-image d-block w-100 h-100"
                                    src={slideImage}
                                    alt="First slide"
                                />
                                <div className='py-2 py-sm-4'>
                                    <p className='about-odessa-text m-0'>
                                        <span className='font-weight-bold'>Одеса</span> це третє за кількістю населення місто України. Зосереджено на півдні України, являється адміністративним центром Одеської області. В місті Одеса зосереджений найбільший порт України.
                                    </p>
                                    <p className='about-odessa-text m-0'>
                                        Це місто на чорноморському узбережжі України; місто-герой, культурний, освітньо-науковий, туристичний та торговий осередок країни. Це великий автомобільний та залізничний вузол. Місто являє собою окрему Одеську міську територіальну громаду. За чисельністю населення Одеса є третім в Україні містом після Києва та Харкова. В Одесі діють: машинобудівна, хімічна, нафтопереробна, харчова та легка промисловості. Також налічується 37 закладів вищої освіти, шість театрів, вісім кінотеатрів, філармонія, цирк, музеї, галереї тощо.
                                    </p>
                                    <p className='about-odessa-text'>Перші поселення на території сучасного міста були засновані близько VII століття до н. е. — III століття н. е. давньогрецькими мореплавцями. Згодом цю місцевість заселила Ногайська орда, яка через якийсь час влилася до Золотої орди. Приблизно у 1341 році узбережжя захопило Велике князівство Литовське-Руське-Жемайтійське. Саме у той час було засновано фортецю та селище Коцюбіїв, що згодом було перейменоване на Хаджибей. 14 (25) вересня 1789 року його було завойовано козацько-російськими військами під командуванням Хосе де Рібаса. Саме після захоплення фортеці поселення було перейменоване на Одесу й отримало статус міста. З 1819 року по 1859 рік у місті діяв торговий режим «порто-франко», що сприяв його стрімкому економічному розвитку. Після захоплення більшовиками Української Народної Республіки Одеса перейшла під вплив комуністичної влади. Під час Другої світової війни Одеса була захоплена німецько-румунськими військами.
                                    Історичний центр Одеси з 2009 року перебуває в попередньому спискові об'єктів Світової спадщини ЮНЕСКО. У центральній частині міста — ансамбль будівель кінця XVIII—XIX століть у стилях класицизму, ампіру, модерну тощо. У межах Одеси та її околицях знаходяться кліматичні та бальнеологічні курорти. Також під містом знаходиться велика мережа підземних ходів і лабіринтів, які утворюють одну з найбільших у світі катакомб із довжиною тунелів приблизно 2,5 тисячі кілометрів.
                                    </p>
                                </div>
                            </div>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="slide-image d-block w-100 h-100"
                                    src={slideImage2}
                                    alt="First slide"
                                />
                                <p className='py-2 py-sm-4 about-odessa-text'>
                                    <span className='font-weight-bold'>Дерибасівська вулиця </span> - головна вулиця цього чудового курортного міста. Це головна комерційна вулиця, наповнена численними магазинами, ресторанами та барами, а влітку вона заповнена туристами, які прогулюються вгору і вниз до раннього ранку. Це пішохідна вулиця з різними пам’ятниками та знаменитим Міським садом з музичним фонтаном. Вулиця Дерибасівська названа на честь одного із засновників, який став першим мером цього міста – адмірала Жозефа де Рібаса.
                                </p>
                            </div>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="slide-image d-block w-100 h-100"
                                    src={slideImage3}
                                    alt="First slide"
                                />
                                <p className='py-2 py-sm-4 about-odessa-text'>
                                     <span className='font-weight-bold'>Театр опери та балету.</span> Дивовижна будівля Одеського театру опери та балету є однією з найбільш впізнаваних визначних пам'яток міста. Він був побудований у 1880-х роках Фердинандом Фельнером і Германом Гельмером (вони також спроектували знамениту Віденську державну оперу!). Абсолютно захоплюючий інтер’єр оформлений у стилі віденського бароко з поєднанням італійського Відродження та французького рококо. Скульптури зовні зображують героїв з грецької міфології. Театр опери та балету має найкращу акустику, і навіть шепіт на сцені можна почути в будь-якій частині залу. Оперний театр по праву входить у ТОП-10 найкрасивіших у Європі!</p>
                            </div>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="slide-image d-block w-100 h-100"
                                    src={slideImage4}
                                    alt="First slide"
                                />
                                <p className='py-2 py-sm-4 about-odessa-text'>
                                      <span className='font-weight-bold'>Морський порт.</span> Найпотужніший і завантажений порт України знаходиться в Одесі. Історія морського порту (Морського торгового порту) почалася в 1794 році. Сьогодні набережна і портові території оснащені близько сотнями кранів, а також тисячами навантажувачів та іншої портової техніки. У порту є кілька терміналів: пасажирський термінал, вантажний термінал, нафтогазовий термінал, контейнерний термінал тощо. Пасажирський термінал у центральній частині міста містить морську галерею, концертно-виставковий зал, якірний музей, музей морського флоту України, яхтного комплексу та дайвінг -центру. Коли тепло, ви можете покататися на одному з багатьох кораблів або яхт, які стоять на якорі в морському порту.
                                </p>
                            </div>
                            <div className='border-0 d-block m-0 pb-3 pb-sm-5'>
                                <img
                                    className="slide-image d-block w-100 h-100"
                                    src={slideImage5}
                                    alt="First slide"
                                />
                                <p className='py-2 py-sm-4 about-odessa-text'>
                                      <span className='font-weight-bold'>Пляж Аркадія. </span> Пляж Аркадія (або Аркадія) дійсно є найпопулярнішим пляжем у місті. Він розташований у районі з досить дорогими житловими будинками з однойменною назвою- Аркадія. Прибережний район повний різноманітних готелів і курортів, барів і нічних клубів. Насправді, Аркадія - це не просто популярний пляж серед місцевих жителів та мандрівників, це головне місце для нічного життя в теплі місяці року. Нічні клуби на пляжі Аркадія відкриті з травня по вересень. Тож, якщо ви хочете по-справжньому розважитися, вам варто прийти в цю зону
                                </p>
                            </div>
                        </div>
            </div>
        )
    }
}

export default About;
